# 450+ Practice Questions From Pandas, NumPy, and SQL.

Author: **Avi Chawla**

LinkedIn: https://www.linkedin.com/in/avi-chawla/

Read my newsletter here: https://www.blog.dailydoseofds.com/

## Introduction

This notebook has been created for you to practice three of the most common tools used in building any machine learning or data science applications, i.e., Pandas, NumPy, and SQL!

The practice questions provided will serve as a great resource for those who are looking to familiarize themselves with some of the most common functions used in these tools.

Appropriate descriptions have been provided for all the questions in this entire exercise which will help you navigate through this exercise easily. If a dataset is to be loaded in the python environment, that has also been provided for you. You can find it on the right panel in the Files section. Do NOT delete any of the files/folders listed there.

The whole exercise has been divided into nine separate notebooks. Below are the links to all the other notebooks for you to jump from one notebook to another:

- **Pandas**

1. Pandas Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-1-d693ac55-6455-40cf-ae34-867c6a02014e/notebook/6449493c84734151b11f4b6871f045d2#99f75bf946d04b9bb1daa9e14c2cfea9) 
2. Pandas Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-dataset-7e3b6755-5d4b-464b-9b75-9c84667ae3bd/notebook/notebook-0de50f3b70834570b13b651dde44c491) **(This Notebook)** 

3. Pandas Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-part-2-adc5a3ee-5f61-4725-8e46-ccb07899acfc/notebook/notebook-78e3faf901da4f14881ef24e41c80bf6)

4. Pandas Notebook 4: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-after-employee-f84e02a1-fb6a-428e-af90-8dd99855749a/notebook/notebook-134ac20c38ef45e5a4432abd638e6c2e)

- **NumPy**

1. NumPy Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Numpy-part-1-9b9979f2-b708-4292-b466-3d0157564c91/notebook/notebook-07232b5ebafe49b198a9c55c553414f1)

2. NumPy Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-2-4456411e-2ddd-426d-8027-4881080027db/notebook/notebook-988aba30f33a45a3861adc4f6a6f338c)

3. NumPy Notebook 3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/NumPy-Notebook-3-e6587114-b580-4249-b599-540de859e603/notebook/notebook-bb52759ea3f542eaaed9958b5df9c34b)

- **SQL**

1. SQL Notebook 1: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-1-eac9d782-a9b1-4e84-a1f9-af14080a6121/notebook/notebook-697f04297c664d02901db0f85431512e)

2. SQL Notebook 2: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/SQL-Notebook-2-1914b214-be03-44a1-be63-ad99e98be639/notebook/notebook-e549236b988c42a5b53126a7ebb98127)

## How to use this notebook?

At the top right corner, you will find a Duplicate button. This will allow you to create a unique notebook for your own practice and write solutions to the question listed in this notebook.

If you face any issues or have any feedback, feel free to reach out to me (Avi Chawla) either on Linkedin: https://www.linkedin.com/in/avi-chawla/ or write an email to avi@dsscholar[dot]com.

Let's begin ðŸš€!

# Pandas Notebook 2

### 31. Read the CSV file.

In [1]:
import pandas as pd
file_name = "employee_dataset.csv"

df = pd.read_csv(file_name)

### 32. Print the first 5 rows.

In [2]:
df_temp = df.head()

print(df_temp)

             Name                  Company_Name
0  Spencer Adkins                James and Sons  \
1    Julie Morton                 Nichols-James
2    Matthew Hall                     Scott Inc
3      Brad Scott  Johnston, Fleming and Tanner
4   Theresa Owens      Baker, Allen and Edwards

                        Employee_Job_Title      Employee_City
0                          Equities trader     New Russellton  \
1  Diplomatic Services operational officer  North Melissafurt
2               Regulatory affairs officer           Wardfort
3                      Production engineer     West Jamesview
4                      Production engineer          Whiteside

        Employee_Country  Employee_Salary Employment_Status  Employee_Rating
0  Palestinian Territory           321520         Full Time              3.9
1       Marshall Islands           589090         Full Time              4.3
2               Anguilla           630890         Full Time              3.1
3   Syrian Arab Republic           116400         Full Time              3.1
4               Dominica           523499         Full Time              4.8

### 33. Print the last 10 rows.

In [3]:
df_temp = df.tail(10)

print(df_temp)

                     Name                  Company_Name
299990      Monica Bender    Wallace, Smith and Shepard  \
299991  William Rodriguez                     Scott Inc
299992    Steven Thornton      Baker, Allen and Edwards
299993         Terry Hill       White, Mcclain and Cobb
299994      Kelly Bennett       White, Mcclain and Cobb
299995         Nancy Neal              Bullock-Carrillo
299996     Michele Butler  Johnston, Fleming and Tanner
299997        Lynn Wilson                 Nichols-James
299998      Lindsey Keith                 Nichols-James
299999      Karen Delgado                James and Sons

                  Employee_Job_Title      Employee_City Employee_Country
299990           Production engineer   New Cindychester       Bangladesh  \
299991                    Ergonomist          Whiteside      New Zealand
299992               Patent examiner         Aliciafort            Benin
299993  Investment banker, corporate   New Cindychester           Sweden
299994     Radiographer, therapeutic           Wardfort             Fiji
299995                   Optometrist  North Melissafurt            Samoa
299996                 Administrator         Aliciafort             Cuba
299997                 Administrator   New Cindychester          Bolivia
299998                          Make       Whitakerbury   Western Sahara
299999                       Actuary     New Russellton   United Kingdom

        Employee_Salary Employment_Status  Employee_Rating
299990           852660         Full Time              3.0
299991           214400         Full Time              1.5
299992            60240         Full Time              4.3
299993           414720            Intern              2.3
299994           182270         Full Time              3.6
299995            99670            Intern              3.3
299996           949580            Intern              2.6
299997           802830         Full Time              0.6
299998           257240         Full Time              2.4
299999           575770            Intern              3.3

### 34. Print the number of rows.

In [4]:
rows = df.shape[0]

print(rows)

300000

### 35. Print the number of columns.

In [5]:
columns = df.shape[1]

print(columns)

8

### 36. Print all column names.

In [6]:
column_names = df.columns

print(column_names)

Index(['Name', 'Company_Name', 'Employee_Job_Title', 'Employee_City',
       'Employee_Country', 'Employee_Salary', 'Employment_Status',
       'Employee_Rating'],
      dtype='object')

### 37. Print the mean of Employee_Salary.

In [7]:
df["Employee_Salary"].mean()

500224.20772666665

### 38. Print the mean of Employee_Rating.

In [8]:
df["Employee_Rating"].mean()

2.5059550000000006

### 39. Print the number of distinct Company_Name.

In [9]:
df["Company_Name"].nunique()

15

### 40. Print all the distinct Company_Name.

In [10]:
df["Company_Name"].unique()

array(['James and Sons', 'Nichols-James', 'Scott Inc',
       'Johnston, Fleming and Tanner', 'Baker, Allen and Edwards',
       'Andrade LLC', 'Matthews Inc', 'Taylor-Ramos',
       'Campos, Reynolds and Mccormick', 'White, Mcclain and Cobb',
       'Thomas-Spencer', 'Bullock-Carrillo', 'Marshall-Holloway',
       'Wallace, Smith and Shepard', 'Nelson-Li'], dtype=object)

### 41. Print the number of employees working in the company "Nichols-James".

In [11]:
len(df[df["Company_Name"]=="Nichols-James"])

19911

### 42-44. Print the maximum, minimum and median Employee_Salary.

In [12]:
print(max(df["Employee_Salary"]))
print(min(df["Employee_Salary"]))
print(df["Employee_Salary"].mean())

999990
0
500224.20772666665

### 45-49. Print the distribution of the following columns: (the frequency of individual entries).

1. Company_Name

In [13]:
df["Company_Name"].value_counts()

Company_Name
Scott Inc                         20390
White, Mcclain and Cobb           20261
Thomas-Spencer                    20142
Nelson-Li                         20132
Taylor-Ramos                      20122
Baker, Allen and Edwards          20084
Matthews Inc                      20083
Bullock-Carrillo                  20063
Andrade LLC                       19983
Campos, Reynolds and Mccormick    19927
Nichols-James                     19911
James and Sons                    19868
Marshall-Holloway                 19859
Johnston, Fleming and Tanner      19811
Wallace, Smith and Shepard        19364
Name: count, dtype: int64

2. Employee_Job_Title

In [14]:
df["Employee_Job_Title"].value_counts()

Employee_Job_Title
Diplomatic Services operational officer                  30137
Administrator                                            15222
Garment/textile technologist                             15183
Trading standards officer                                15155
Patent examiner                                          15085
Armed forces logistics/support/administrative officer    15050
Retail merchandiser                                      15033
Energy manager                                           15033
Actuary                                                  15030
Investment banker, corporate                             15008
Ergonomist                                               15006
Production engineer                                      15003
Equities trader                                          15000
Naval architect                                          14905
Radiographer, therapeutic                                14882
Regulatory affairs officer                               14869
Optometrist                                              14838
Sales promotion account executive                        14820
Make                                                     14741
Name: count, dtype: int64

3. Employee_City

In [15]:
df["Employee_City"].value_counts()

Employee_City
North Melissafurt    30209
Kristaburgh          30204
Wardfort             30097
Ricardomouth         30052
Aliciafort           30037
New Russellton       30001
West Jamesview       29941
Whitakerbury         29854
Whiteside            29849
New Cindychester     29756
Name: count, dtype: int64

4. Employee_Country

In [16]:
df["Employee_Country"].value_counts()

Employee_Country
Congo                                                  2413
Korea                                                  2301
British Indian Ocean Territory (Chagos Archipelago)    1344
Egypt                                                  1322
Turkey                                                 1308
                                                       ...
Saint Vincent and the Grenadines                       1147
Czech Republic                                         1145
Mexico                                                 1144
Mauritania                                             1139
Ukraine                                                1133
Name: count, Length: 243, dtype: int64

5. Employment_Status

In [17]:
df["Employment_Status"].value_counts()

Employment_Status
Full Time    240010
Intern        59990
Name: count, dtype: int64

### 50. Print the company with the most number of employees.

In [18]:
# df["Company_Name"].value_counts().sort_values(ascending=False).reset_index().iloc[0]

df["Company_Name"].mode()[0]

'Scott Inc'

### 51. Print the number of employees in the above company.

In [19]:
df[df["Company_Name"]=="Scott Inc"].shape[0]

20390

### 52. Print the company with the least number of employees.

In [20]:
# df["Company_Name"].value_counts().sort_values().reset_index().iloc[0:1]

df["Company_Name"].value_counts().idxmin()

'Wallace, Smith and Shepard'

### 53. Print the number of employees in the above company.

In [21]:
df["Company_Name"].value_counts().min()

19364

### 54. Print the employee details with the maximum salary

In [22]:
df[df["Employee_Salary"]==max(df["Employee_Salary"])]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
70356,Anna Lawson,Taylor-Ramos,Production engineer,Kristaburgh,Lesotho,999990,Full Time,4.0

### 55. Print the employee details with the maximum rating

In [23]:
df[df["Employee_Rating"]==max(df["Employee_Rating"])]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
124,Joshua Huffman,James and Sons,Garment/textile technologist,New Russellton,Cook Islands,694760,Full Time,5.0
342,Alan Carlson,"Baker, Allen and Edwards",Diplomatic Services operational officer,Kristaburgh,Mongolia,491710,Intern,5.0
391,Lisa Summers,"Johnston, Fleming and Tanner",Regulatory affairs officer,North Melissafurt,Togo,933500,Full Time,5.0
395,Timothy Woods,"Johnston, Fleming and Tanner",Garment/textile technologist,Whiteside,United States Virgin Islands,367630,Full Time,5.0
415,Cameron Hawkins,Taylor-Ramos,Armed forces logistics/support/administrative ...,Wardfort,Tanzania,66570,Intern,5.0
...,...,...,...,...,...,...,...,...
299689,Michael Jordan,"Johnston, Fleming and Tanner",Naval architect,Whitakerbury,Philippines,474540,Full Time,5.0
299855,Rebecca Garrison,Nelson-Li,Production engineer,Whitakerbury,Ireland,592530,Full Time,5.0
299900,Daniel Jones,Taylor-Ramos,Sales promotion account executive,Kristaburgh,Sierra Leone,32160,Full Time,5.0
299906,Justin Mendez,Bullock-Carrillo,Regulatory affairs officer,New Cindychester,Colombia,374540,Full Time,5.0
299973,Doris Miller,Andrade LLC,Armed forces logistics/support/administrative ...,Wardfort,Kazakhstan,943340,Intern,5.0

### 56. Print the Company_Name with most number of employees in 'Wardfort' city.

In [24]:
a = df[df["Employee_City"]=="Wardfort"]
a["Company_Name"].mode()[0]

'White, Mcclain and Cobb'

### 57. Change the Data type of 'Employee_Salary' column to float.

In [25]:
df = df.astype({"Employee_Salary":"float"})

In [26]:
df.dtypes

Name                   object
Company_Name           object
Employee_Job_Title     object
Employee_City          object
Employee_Country       object
Employee_Salary       float64
Employment_Status      object
Employee_Rating       float64
dtype: object

### 58. Print the Employee_City with the most number of 'Production engineer'.

In [27]:
df[df["Employee_Job_Title"]=="Production engineer"]["Employee_City"].mode()[0]

'Aliciafort'

### 59. Print the Company_Name with the most number of Full-time Employees.

In [28]:
df[df["Employment_Status"]=="Full Time"]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520.0,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090.0,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890.0,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400.0,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499.0,Full Time,4.8
...,...,...,...,...,...,...,...,...
299991,William Rodriguez,Scott Inc,Ergonomist,Whiteside,New Zealand,214400.0,Full Time,1.5
299992,Steven Thornton,"Baker, Allen and Edwards",Patent examiner,Aliciafort,Benin,60240.0,Full Time,4.3
299994,Kelly Bennett,"White, Mcclain and Cobb","Radiographer, therapeutic",Wardfort,Fiji,182270.0,Full Time,3.6
299997,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830.0,Full Time,0.6
299998,Lindsey Keith,Nichols-James,Make,Whitakerbury,Western Sahara,257240.0,Full Time,2.4

### 60. Print the Company_Name with the highest average 'Employee_Rating'.

In [ ]:
df.groupby(by=["Company_Name"])[["Employee_Rating"]].mean().reset_index().sort_values(by="Employee_Rating",ascending=False)

# df.groupby("Company_Name")["Employee_Rating"].mean().idxmax() (better)

                      Company_Name  Employee_Rating
7                     Matthews Inc         2.525454
10                       Scott Inc         2.515993
5     Johnston, Fleming and Tanner         2.513159
11                    Taylor-Ramos         2.513150
3   Campos, Reynolds and Mccormick         2.506288
12                  Thomas-Spencer         2.505114
4                   James and Sons         2.505023
6                Marshall-Holloway         2.504900
1         Baker, Allen and Edwards         2.504795
8                        Nelson-Li         2.504649
14         White, Mcclain and Cobb         2.504047
2                 Bullock-Carrillo         2.502014
0                      Andrade LLC         2.498218
13      Wallace, Smith and Shepard         2.497402
9                    Nichols-James         2.488554

### 61. Print the number of employees working in 'Ricardomouth' and 'Kristaburgh' location combined.

In [41]:
len(df[df["Employee_City"].isin(["Kristaburgh","Ricardomouth"])])

60256

### 62. Print the distinct Company_Name corresponding to the 5 highest paid employees in the dataset.

In [ ]:
df.sort_values(by="Employee_Salary",ascending=False)[["Company_Name"]].drop_duplicates().head(5)

# df.nlargest(5, 'Employee_Salary')['Company_Name'].unique() (better)

                          Company_Name
70356                     Taylor-Ramos
51642                   Thomas-Spencer
50461          White, Mcclain and Cobb
23536   Campos, Reynolds and Mccormick
296423                  James and Sons

### 63. Check if there are any duplicate rows in the DataFrame.

In [ ]:
df[df.duplicated()]

# df.duplicated().value_counts()

Empty DataFrame
Columns: [Name, Company_Name, Employee_Job_Title, Employee_City, Employee_Country, Employee_Salary, Employment_Status, Employee_Rating]
Index: []

### 64. Check if any of the columns has NaN values.

In [53]:
df.isnull().sum()

Name                  0
Company_Name          0
Employee_Job_Title    0
Employee_City         0
Employee_Country      0
Employee_Salary       0
Employment_Status     0
Employee_Rating       0
dtype: int64

### 65. Print the data type of every column in the DataFrame.

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300000 entries, 0 to 299999
Data columns (total 8 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   Name                300000 non-null  object
 1   Company_Name        300000 non-null  object
 2   Employee_Job_Title  300000 non-null  object
 3   Employee_City       300000 non-null  object
 4   Employee_Country    300000 non-null  object
 5   Employee_Salary     300000 non-null  int64
 6   Employment_Status   300000 non-null  object
 7   Employee_Rating     300000 non-null  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 18.3+ MB

### 66. Print the Company_Name column only as a Series

In [3]:
df.columns

Index(['Name', 'Company_Name', 'Employee_Job_Title', 'Employee_City',
       'Employee_Country', 'Employee_Salary', 'Employment_Status',
       'Employee_Rating'],
      dtype='object')

### 67. Print the Company_Name column only as a DataFrame

In [4]:
df[["Company_Name"]]

                        Company_Name
0                     James and Sons
1                      Nichols-James
2                          Scott Inc
3       Johnston, Fleming and Tanner
4           Baker, Allen and Edwards
...                              ...
299995              Bullock-Carrillo
299996  Johnston, Fleming and Tanner
299997                 Nichols-James
299998                 Nichols-James
299999                James and Sons

[300000 rows x 1 columns]

### 68. Select the 'Employee_Job_Title' and 'Employee_City' column.

In [5]:
df[["Employee_Job_Title","Employee_City"]]

                             Employee_Job_Title      Employee_City
0                               Equities trader     New Russellton
1       Diplomatic Services operational officer  North Melissafurt
2                    Regulatory affairs officer           Wardfort
3                           Production engineer     West Jamesview
4                           Production engineer          Whiteside
...                                         ...                ...
299995                              Optometrist  North Melissafurt
299996                            Administrator         Aliciafort
299997                            Administrator   New Cindychester
299998                                     Make       Whitakerbury
299999                                  Actuary     New Russellton

[300000 rows x 2 columns]

### 69. Print the number of employees with Employee_Rating greater than the average Employee_Rating

In [ ]:
a = df["Employee_Rating"].mean()
df.loc[df["Employee_Rating"]>a].shape[0]

# alternate query
#  sum(df["Employee_Rating"]>a)

147548

### 70. Find the employee which has the maximum salary among the ones with  the minimum Employee_Rating

In [11]:
m = min(df["Employee_Rating"])
ans = df[df["Employee_Rating"]==m]

ans.loc[ans["Employee_Salary"].idxmax()]
# ans[ans["Employee_Salary"] == max(ans["Employee_Salary"])][["Name"]]

Name                             Austin Poole
Company_Name          White, Mcclain and Cobb
Employee_Job_Title              Administrator
Employee_City                       Whiteside
Employee_Country        Saint Kitts and Nevis
Employee_Salary                        999690
Employment_Status                      Intern
Employee_Rating                           0.0
Name: 240878, dtype: object

### 71. Sort the DataFrame in ascending order of Employee_Salary

In [12]:
df.sort_values(by="Employee_Salary")

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
54531,Kristen Vasquez,"White, Mcclain and Cobb",Armed forces logistics/support/administrative ...,Wardfort,Bermuda,0,Full Time,3.4
205070,Courtney Singleton,"White, Mcclain and Cobb",Garment/textile technologist,New Cindychester,Ethiopia,0,Full Time,2.8
185700,Vanessa Wu,"Campos, Reynolds and Mccormick",Patent examiner,North Melissafurt,Zambia,10,Full Time,1.3
226792,Penny Meza,"Wallace, Smith and Shepard",Trading standards officer,Wardfort,Albania,10,Full Time,0.7
229395,Grace Smith,"Johnston, Fleming and Tanner",Trading standards officer,West Jamesview,Libyan Arab Jamahiriya,10,Intern,1.1
...,...,...,...,...,...,...,...,...
23536,Dennis Sexton,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,Kristaburgh,United Kingdom,999970,Full Time,0.9
50461,Logan Jackson,"White, Mcclain and Cobb",Ergonomist,Wardfort,Saint Helena,999980,Full Time,2.0
153993,Jason Jenkins,Taylor-Ramos,Sales promotion account executive,Aliciafort,Pakistan,999980,Full Time,2.6
51642,Richard Kennedy,Thomas-Spencer,Energy manager,Aliciafort,Cook Islands,999980,Full Time,2.4
70356,Anna Lawson,Taylor-Ramos,Production engineer,Kristaburgh,Lesotho,999990,Full Time,4.0

### 72. Sort the DataFrame in descending order of Employee_Rating

In [13]:
df.sort_values(by="Employee_Rating",ascending=False)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
222544,Laura Lopez,Scott Inc,Equities trader,Whiteside,British Virgin Islands,271140,Full Time,5.0
26453,Adriana Ferrell,"Johnston, Fleming and Tanner",Ergonomist,Aliciafort,Gabon,678800,Intern,5.0
141265,Russell Dorsey,"Baker, Allen and Edwards",Optometrist,Aliciafort,Morocco,816320,Full Time,5.0
184624,Katherine Jenkins,Matthews Inc,Make,New Cindychester,Nauru,498850,Full Time,5.0
70533,Brittney Greene,James and Sons,Energy manager,Ricardomouth,Bulgaria,332780,Full Time,5.0
...,...,...,...,...,...,...,...,...
50012,Sara King,Matthews Inc,Diplomatic Services operational officer,Whiteside,Iran,986490,Intern,0.0
289392,Heather Paul,Nelson-Li,Make,Wardfort,French Southern Territories,712720,Full Time,0.0
14752,Kathryn Goodwin,"Baker, Allen and Edwards",Energy manager,New Cindychester,Moldova,557330,Full Time,0.0
204854,Nina Yang,"Wallace, Smith and Shepard",Armed forces logistics/support/administrative ...,Wardfort,Swaziland,744300,Intern,0.0
242616,Melissa Johnston,Matthews Inc,Diplomatic Services operational officer,Whiteside,Macao,704700,Intern,0.0

### 73. Print the name of 100th employee after sorting on Name

In [17]:
df.sort_values(by="Name").iloc[100]

Name                        Aaron Brown
Company_Name           Bullock-Carrillo
Employee_Job_Title           Ergonomist
Employee_City         North Melissafurt
Employee_Country                Burundi
Employee_Salary                  947390
Employment_Status                Intern
Employee_Rating                     1.6
Name: 283977, dtype: object

### 74. Print the first 5 rows of the first 5 columns.

In [18]:
df.iloc[:5,:5]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica

### 75. Print the transpose of the first 5 rows

In [19]:
df.head(5).T

,0,1,2,3,4
Name,Spencer Adkins,Julie Morton,Matthew Hall,Brad Scott,Theresa Owens
Company_Name,James and Sons,Nichols-James,Scott Inc,"Johnston, Fleming and Tanner","Baker, Allen and Edwards"
Employee_Job_Title,Equities trader,Diplomatic Services operational officer,Regulatory affairs officer,Production engineer,Production engineer
Employee_City,New Russellton,North Melissafurt,Wardfort,West Jamesview,Whiteside
Employee_Country,Palestinian Territory,Marshall Islands,Anguilla,Syrian Arab Republic,Dominica
Employee_Salary,321520,589090,630890,116400,523499
Employment_Status,Full Time,Full Time,Full Time,Full Time,Full Time
Employee_Rating,3.9,4.3,3.1,3.1,4.8

### 76. Print the number of employees whose first name starts with the letter 'V'.

In [ ]:
df["Name"].str.startswith("V").sum()

# or
# df[df["Name"].str.startswith("V")].shape[0]

3683

### 77. Print the number of employees whose last name starts with the letter 'R'.

In [25]:
df["Name"].str.split().str[-1].str.startswith("R").sum()

20712

### 78. Select the rows 2 to 7 and the columns 3 to 7 (both included)

In [27]:
df.iloc[2:8,3:8]

,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
2,Wardfort,Anguilla,630890,Full Time,3.1
3,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Whiteside,Dominica,523499,Full Time,4.8
5,Ricardomouth,Mali,850140,Full Time,2.6
6,Wardfort,Aruba,711410,Full Time,2.0
7,Kristaburgh,Western Sahara,777000,Full Time,3.3

### 79. Select every row after the 10th row and select all columns.

In [28]:
df.iloc[10:]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
10,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260,Full Time,4.9
11,Timothy Johnson,"Baker, Allen and Edwards",Regulatory affairs officer,Ricardomouth,Georgia,503610,Full Time,2.9
12,Tiffany Galvan,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,West Jamesview,Niger,786430,Intern,3.6
13,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210,Full Time,4.9
14,Julie Cook,Matthews Inc,Equities trader,New Russellton,Puerto Rico,328860,Full Time,4.8
...,...,...,...,...,...,...,...,...
299995,Nancy Neal,Bullock-Carrillo,Optometrist,North Melissafurt,Samoa,99670,Intern,3.3
299996,Michele Butler,"Johnston, Fleming and Tanner",Administrator,Aliciafort,Cuba,949580,Intern,2.6
299997,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830,Full Time,0.6
299998,Lindsey Keith,Nichols-James,Make,Whitakerbury,Western Sahara,257240,Full Time,2.4
299999,Karen Delgado,James and Sons,Actuary,New Russellton,United Kingdom,575770,Intern,3.3

### 80. Select every row up to the 10th row and select all columns.

In [29]:
df.head(10)

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8
5,Vanessa Allen,Andrade LLC,Make,Ricardomouth,Mali,850140,Full Time,2.6
6,Kelly Brown,Andrade LLC,Naval architect,Wardfort,Aruba,711410,Full Time,2.0
7,Vicki Beard,Matthews Inc,Diplomatic Services operational officer,Kristaburgh,Western Sahara,777000,Full Time,3.3
8,Lisa French,Taylor-Ramos,"Radiographer, therapeutic",West Jamesview,Kuwait,870580,Full Time,1.3
9,Michael Edwards,"Campos, Reynolds and Mccormick",Ergonomist,New Cindychester,Lao People's Democratic Republic,516950,Full Time,2.3

### 81. Select rows with employee rating > 4.5.

In [30]:
df[df["Employee_Rating"]>4.5]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8
10,Victoria Sutton,"White, Mcclain and Cobb",Naval architect,Whiteside,Poland,656260,Full Time,4.9
13,David Duran,Nichols-James,"Investment banker, corporate",New Russellton,Georgia,910210,Full Time,4.9
14,Julie Cook,Matthews Inc,Equities trader,New Russellton,Puerto Rico,328860,Full Time,4.8
49,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320,Full Time,4.7
...,...,...,...,...,...,...,...,...
299910,Daniel Johnson,"Baker, Allen and Edwards",Energy manager,Wardfort,American Samoa,452970,Full Time,4.7
299952,Joshua Knight,Nichols-James,Sales promotion account executive,Wardfort,Mali,175450,Intern,4.9
299957,Martha Phillips,Matthews Inc,Naval architect,Wardfort,Somalia,485270,Full Time,4.8
299973,Doris Miller,Andrade LLC,Armed forces logistics/support/administrative ...,Wardfort,Kazakhstan,943340,Intern,5.0
299981,Herbert Bailey,Nichols-James,"Radiographer, therapeutic",New Cindychester,Guernsey,165550,Full Time,4.8

### 82. Select rows with employee rating > 4.5 and < 4.8.

In [31]:
df[(df["Employee_Rating"]>4.5) & (df["Employee_Rating"]<4.8)]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
49,Gerald Santiago,Thomas-Spencer,Garment/textile technologist,Kristaburgh,El Salvador,873320,Full Time,4.7
88,Julie Richard,Bullock-Carrillo,Naval architect,Wardfort,Burundi,222850,Full Time,4.6
94,Natasha Harmon,Matthews Inc,"Radiographer, therapeutic",West Jamesview,Bolivia,790000,Full Time,4.7
119,Jason Parrish,Andrade LLC,Garment/textile technologist,Aliciafort,Cote d'Ivoire,581130,Full Time,4.7
129,Connie Coleman,Andrade LLC,Optometrist,Kristaburgh,Indonesia,899260,Full Time,4.7
...,...,...,...,...,...,...,...,...
299757,Melissa Perry,Marshall-Holloway,Trading standards officer,Whiteside,Russian Federation,712460,Full Time,4.7
299765,Jeremy Ramirez,Thomas-Spencer,Diplomatic Services operational officer,Ricardomouth,Netherlands,330640,Intern,4.6
299772,Adam Moss,"Johnston, Fleming and Tanner",Garment/textile technologist,Whiteside,Lao People's Democratic Republic,298790,Intern,4.6
299820,Brandi Christian,James and Sons,Make,North Melissafurt,Palestinian Territory,503370,Intern,4.6
299910,Daniel Johnson,"Baker, Allen and Edwards",Energy manager,Wardfort,American Samoa,452970,Full Time,4.7

### 83. Print the name of the company with the maximum employees having rating > 4.

In [35]:
ans = df[df["Employee_Rating"]>4]
ans.groupby("Company_Name")["Employee_Rating"].count().idxmax()

'Matthews Inc'

### 84. Print the rating of the employee named 'Julie Morton'.

In [36]:
df[df["Name"]=="Julie Morton"][["Employee_Rating"]]

   Employee_Rating
1              4.3

### 85. Print the last 3rd entry in the column Employee_City

In [37]:
df.tail(3)["Employee_City"]

299997    New Cindychester
299998        Whitakerbury
299999      New Russellton
Name: Employee_City, dtype: object

### 86. Print the Employee_City column as a list

In [38]:
df["Employee_City"].tolist()

['New Russellton',
 'North Melissafurt',
 'Wardfort',
 'West Jamesview',
 'Whiteside',
 'Ricardomouth',
 'Wardfort',
 'Kristaburgh',
 'West Jamesview',
 'New Cindychester',
 'Whiteside',
 'Ricardomouth',
 'West Jamesview',
 'New Russellton',
 'New Russellton',
 'Ricardomouth',
 'North Melissafurt',
 'Whitakerbury',
 'New Russellton',
 'New Russellton',
 'Aliciafort',
 'Wardfort',
 'Kristaburgh',
 'Aliciafort',
 'Wardfort',
 'Kristaburgh',
 'Whiteside',
 'Wardfort',
 'West Jamesview',
 'West Jamesview',
 'New Russellton',
 'Wardfort',
 'Aliciafort',
 'North Melissafurt',
 'West Jamesview',
 'New Cindychester',
 'Wardfort',
 'New Russellton',
 'New Russellton',
 'Kristaburgh',
 'Kristaburgh',
 'West Jamesview',
 'Ricardomouth',
 'Whiteside',
 'Ricardomouth',
 'North Melissafurt',
 'Whitakerbury',
 'Whitakerbury',
 'Whiteside',
 'Kristaburgh',
 'Ricardomouth',
 'New Russellton',
 'Ricardomouth',
 'Aliciafort',
 'Aliciafort',
 'North Melissafurt',
 'Whiteside',
 'Kristaburgh',
 'North Melissafurt',
 'North Melissafurt',
 'Whitakerbury',
 'Whitakerbury',
 'Whiteside',
 'New Cindychester',
 'Aliciafort',
 'North Melissafurt',
 'Aliciafort',
 'Whiteside',
 'Wardfort',
 'Aliciafort',
 'Wardfort',
 'West Jamesview',
 'New Cindychester',
 'Aliciafort',
 'Whiteside',
 'Ricardomouth',
 'Wardfort',
 'New Cindychester',
 'West Jamesview',
 'Whiteside',
 'Whitakerbury',
 'New Cindychester',
 'Wardfort',
 'Kristaburgh',
 'New Cindychester',
 'Whitakerbury',
 'Kristaburgh',
 'Kristaburgh',
 'Wardfort',
 'Whitakerbury',
 'Kristaburgh',
 'Aliciafort',
 'New Russellton',
 'New Russellton',
 'West Jamesview',
 'New Russellton',
 'West Jamesview',
 'Wardfort',
 'Whiteside',
 'Whiteside',
 'New Russellton',
 'Kristaburgh',
 'Kristaburgh',
 'West Jamesview',
 'Whitakerbury',
 'Wardfort',
 'Aliciafort',
 'New Russellton',
 'Whitakerbury',
 'Ricardomouth',
 'West Jamesview',
 'New Cindychester',
 'Whitakerbury',
 'Whitakerbury',
 'West Jamesview',
 'New Russellton',
 'New Cindychester',
 'Aliciafort',
 'West Jamesview',
 'Aliciafort',
 'Whiteside',
 'West Jamesview',
 'North Melissafurt',
 'Whitakerbury',
 'New Russellton',
 'West Jamesview',
 'Wardfort',
 'Whiteside',
 'Whitakerbury',
 'Kristaburgh',
 'New Cindychester',
 'North Melissafurt',
 'Aliciafort',
 'Whiteside',
 'Wardfort',
 'Whitakerbury',
 'Kristaburgh',
 'New Cindychester',
 'New Russellton',
 'Kristaburgh',
 'Whitakerbury',
 'New Cindychester',
 'Whitakerbury',
 'West Jamesview',
 'Whitakerbury',
 'Wardfort',
 'North Melissafurt',
 'West Jamesview',
 'Whitakerbury',
 'West Jamesview',
 'Ricardomouth',
 'Aliciafort',
 'Whitakerbury',
 'Whiteside',
 'Whiteside',
 'West Jamesview',
 'North Melissafurt',
 'West Jamesview',
 'Aliciafort',
 'Whiteside',
 'New Russellton',
 'Whitakerbury',
 'Whitakerbury',
 'North Melissafurt',
 'Kristaburgh',
 'West Jamesview',
 'Kristaburgh',
 'Wardfort',
 'New Russellton',
 'West Jamesview',
 'Whitakerbury',
 'Aliciafort',
 'New Cindychester',
 'New Cindychester',
 'Whiteside',
 'Ricardomouth',
 'New Cindychester',
 'New Cindychester',
 'Aliciafort',
 'Kristaburgh',
 'New Cindychester',
 'North Melissafurt',
 'Wardfort',
 'Wardfort',
 'Kristaburgh',
 'New Cindychester',
 'Wardfort',
 'West Jamesview',
 'North Melissafurt',
 'Whiteside',
 'New Russellton',
 'New Russellton',
 'Kristaburgh',
 'Whiteside',
 'New Cindychester',
 'North Melissafurt',
 'Whitakerbury',
 'West Jamesview',
 'Whiteside',
 'Whiteside',
 'Whitakerbury',
 'New Russellton',
 'Kristaburgh',
 'Kristaburgh',
 'West Jamesview',
 'Whitakerbury',
 'North Melissafurt',
 'Kristaburgh',
 'West Jamesview',
 'Whiteside',
 'North Melissafurt',
 'New Cindychester',
 'Wardfort',
 'New Cindychester',
 'Aliciafort',
 'Kristaburgh',
 'Aliciafort',
 'Wardfort',
 'Kristaburgh',
 'North Melissafurt',
 'West Jamesview',
 'Ricardomouth',
 'Aliciafort',
 'Kristaburgh',
 'North Melissafurt',
 'Whiteside',
 'Kristaburgh',
 'North Melissafurt',
 'New Russellton',
 'Ricardomouth',
 'New Russellton',
 'New Russellton',
 'North Melissafurt',
 'New Russellton',
 'Ricardomouth',
 'North Melissafurt',
 'Whitakerbury',
 'Kristaburgh',
 'New Cindychester',
 'Wardfort',
 'Ricardomouth',
 'Aliciafort',
 'New Cindychester',
 'Kristaburgh',
 'Wardfort',
 'Wardfort',
 'Aliciafort',
 'Ricardomouth',
 'Ricardomouth',
 'New Russellton',
 'New Russellton',
 'Aliciafort',
 'North Melissafurt',
 'West Jamesview',
 'Whiteside',
 'Ricardomouth',
 'West Jamesview',
 'West Jamesview',
 'West Jamesview',
 'Whitakerbury',
 'New Cindychester',
 'New Russellton',
 'Whitakerbury',
 'Kristaburgh',
 'North Melissafurt',
 'Kristaburgh',
 'North Melissafurt',
 'New Russellton',
 'Aliciafort',
 'North Melissafurt',
 'Aliciafort',
 'Whiteside',
 'New Russellton',
 'Kristaburgh',
 'Kristaburgh',
 'North Melissafurt',
 'Ricardomouth',
 'Kristaburgh',
 'Wardfort',
 'New Russellton',
 'Kristaburgh',
 'Kristaburgh',
 'Whitakerbury',
 'Kristaburgh',
 'Aliciafort',
 'Kristaburgh',
 'Ricardomouth',
 'Whiteside',
 'Aliciafort',
 'Whitakerbury',
 'New Cindychester',
 'Whiteside',
 'New Russellton',
 'Whiteside',
 'Ricardomouth',
 'West Jamesview',
 'New Russellton',
 'West Jamesview',
 'Whiteside',
 'Ricardomouth',
 'West Jamesview',
 'Whiteside',
 'Aliciafort',
 'New Russellton',
 'Kristaburgh',
 'Wardfort',
 'Wardfort',
 'Whiteside',
 'Whiteside',
 'Whitakerbury',
 'West Jamesview',
 'Whitakerbury',
 'New Cindychester',
 'New Russellton',
 'New Russellton',
 'Ricardomouth',
 'New Cindychester',
 'Aliciafort',
 'Whiteside',
 'Ricardomouth',
 'North Melissafurt',
 'Kristaburgh',
 'Ricardomouth',
 'New Cindychester',
 'Wardfort',
 'New Cindychester',
 'Whiteside',
 'Kristaburgh',
 'Ricardomouth',
 'Kristaburgh',
 'Whitakerbury',
 'Aliciafort',
 'Aliciafort',
 'Whitakerbury',
 'Kristaburgh',
 'North Melissafurt',
 'Kristaburgh',
 'Kristaburgh',
 'Whitakerbury',
 'Kristaburgh',
 'Aliciafort',
 'Aliciafort',
 'Kristaburgh',
 'North Melissafurt',
 'Kristaburgh',
 'Aliciafort',
 'Whitakerbury',
 'West Jamesview',
 'New Russellton',
 'Ricardomouth',
 'North Melissafurt',
 'West Jamesview',
 'Aliciafort',
 'New Cindychester',
 'Whitakerbury',
 'Ricardomouth',
 'New Russellton',
 'Aliciafort',
 'West Jamesview',
 'New Cindychester',
 'Ricardomouth',
 'Aliciafort',
 'Wardfort',
 'Whiteside',
 'Ricardomouth',
 'Wardfort',
 'New Cindychester',
 'Wardfort',
 'Wardfort',
 'New Russellton',
 'Kristaburgh',
 'Whitakerbury',
 'Wardfort',
 'Aliciafort',
 'New Cindychester',
 'Whiteside',
 'Whitakerbury',
 'Whitakerbury',
 'Ricardomouth',
 'New Cindychester',
 'Whitakerbury',
 'New Cindychester',
 'New Russellton',
 'Whiteside',
 'New Russellton',
 'West Jamesview',
 'North Melissafurt',
 'Aliciafort',
 'Kristaburgh',
 'Ricardomouth',
 'Wardfort',
 'North Melissafurt',
 'North Melissafurt',
 'West Jamesview',
 'West Jamesview',
 'Whiteside',
 'New Cindychester',
 'West Jamesview',
 'Wardfort',
 'Whiteside',
 'Whiteside',
 'New Cindychester',
 'Whitakerbury',
 'Kristaburgh',
 'Whiteside',
 'Whitakerbury',
 'Kristaburgh',
 'New Cindychester',
 'Aliciafort',
 'Aliciafort',
 'Wardfort',
 'Whiteside',
 'Whitakerbury',
 'North Melissafurt',
 'West Jamesview',
 'Wardfort',
 'West Jamesview',
 'Kristaburgh',
 'Whitakerbury',
 'Wardfort',
 'Whitakerbury',
 'North Melissafurt',
 'Wardfort',
 'Kristaburgh',
 'New Cindychester',
 'West Jamesview',
 'Aliciafort',
 'Kristaburgh',
 'Kristaburgh',
 'Ricardomouth',
 'North Melissafurt',
 'Ricardomouth',
 'Kristaburgh',
 'Whiteside',
 'North Melissafurt',
 'Wardfort',
 'Kristaburgh',
 'New Russellton',
 'Wardfort',
 'Whitakerbury',
 'New Cindychester',
 'Ricardomouth',
 'Ricardomouth',
 'Kristaburgh',
 'Aliciafort',
 'Ricardomouth',
 'Ricardomouth',
 'Whiteside',
 'New Cindychester',
 'Whitakerbury',
 'North Melissafurt',
 'New Russellton',
 'Aliciafort',
 'Ricardomouth',
 'Kristaburgh',
 'Kristaburgh',
 'Whiteside',
 'Ricardomouth',
 'Aliciafort',
 'Whitakerbury',
 'Wardfort',
 'North Melissafurt',
 'Wardfort',
 'Ricardomouth',
 'Wardfort',
 'Whiteside',
 'New Russellton',
 'Whiteside',
 'New Cindychester',
 'Whiteside',
 'Whitakerbury',
 'Ricardomouth',
 'New Cindychester',
 'Wardfort',
 'New Russellton',
 'New Cindychester',
 'New Cindychester',
 'Whitakerbury',
 'Wardfort',
 'Aliciafort',
 'Ricardomouth',
 'West Jamesview',
 'Ricardomouth',
 'Ricardomouth',
 'Whiteside',
 'West Jamesview',
 'New Cindychester',
 'Whitakerbury',
 'Wardfort',
 'Kristaburgh',
 'Ricardomouth',
 'North Melissafurt',
 'Wardfort',
 'North Melissafurt',
 'Kristaburgh',
 'West Jamesview',
 'Kristaburgh',
 'Kristaburgh',
 'Aliciafort',
 'New Russellton',
 'New Russellton',
 'Aliciafort',
 'Ricardomouth',
 'Whiteside',
 'Aliciafort',
 'New Russellton',
 'Whitakerbury',
 'New Russellton',
 'Aliciafort',
 'Ricardomouth',
 'Kristaburgh',
 'Ricardomouth',
 'Kristaburgh',
 'Whiteside',
 'Whiteside',
 'Whiteside',
 'New Russellton',
 'Whiteside',
 'West Jamesview',
 'Wardfort',
 'Whitakerbury',
 'Wardfort',
 'Whiteside',
 'Whiteside',
 'Whiteside',
 'New Cindychester',
 'Whiteside',
 'Kristaburgh',
 'New Russellton',
 'Wardfort',
 'Ricardomouth',
 'New Cindychester',
 'Ricardomouth',
 'Whiteside',
 'North Melissafurt',
 'North Melissafurt',
 'New Cindychester',
 'West Jamesview',
 'New Russellton',
 'Kristaburgh',
 'Whitakerbury',
 'Aliciafort',
 'New Cindychester',
 'New Russellton',
 'North Melissafurt',
 'North Melissafurt',
 'North Melissafurt',
 'Kristaburgh',
 'New Russellton',
 'North Melissafurt',
 'Ricardomouth',
 'Wardfort',
 'Wardfort',
 'Wardfort',
 'Ricardomouth',
 'West Jamesview',
 'Whiteside',
 'Aliciafort',
 'Whitakerbury',
 'Aliciafort',
 'Ricardomouth',
 'Whitakerbury',
 'Whiteside',
 'New Russellton',
 'Whiteside',
 'Kristaburgh',
 'Whitakerbury',
 'Aliciafort',
 'New Russellton',
 'New Cindychester',
 'Aliciafort',
 'North Melissafurt',
 'Ricardomouth',
 'Ricardomouth',
 'New Cindychester',
 'Kristaburgh',
 'Kristaburgh',
 'Wardfort',
 'Kristaburgh',
 'North Melissafurt',
 'Whitakerbury',
 'North Melissafurt',
 'Ricardomouth',
 'Ricardomouth',
 'Aliciafort',
 'New Russellton',
 'West Jamesview',
 'New Cindychester',
 'Wardfort',
 'Whitakerbury',
 'Aliciafort',
 'Wardfort',
 'Aliciafort',
 'Wardfort',
 'North Melissafurt',
 'Wardfort',
 'Whiteside',
 'Ricardomouth',
 'Wardfort',
 'New Russellton',
 'New Cindychester',
 'Whiteside',
 'Whiteside',
 'Whiteside',
 'New Cindychester',
 'Aliciafort',
 'Kristaburgh',
 'Whitakerbury',
 'Kristaburgh',
 'West Jamesview',
 'New Russellton',
 'North Melissafurt',
 'New Russellton',
 'New Russellton',
 'Kristaburgh',
 'Aliciafort',
 'Whiteside',
 'Wardfort',
 'Whiteside',
 'Kristaburgh',
 'Aliciafort',
 'Aliciafort',
 'Aliciafort',
 'Wardfort',
 'Whitakerbury',
 'North Melissafurt',
 'Kristaburgh',
 'Ricardomouth',
 'New Russellton',
 'New Russellton',
 'Wardfort',
 'New Cindychester',
 'North Melissafurt',
 'Ricardomouth',
 'Wardfort',
 'Whitakerbury',
 'Aliciafort',
 'New Cindychester',
 'Ricardomouth',
 'New Russellton',
 'Wardfort',
 'Whiteside',
 'Ricardomouth',
 'Aliciafort',
 'Aliciafort',
 'Ricardomouth',
 'New Cindychester',
 'Ricardomouth',
 'Ricardomouth',
 'Wardfort',
 'Kristaburgh',
 'Whitakerbury',
 'Whitakerbury',
 'Whitakerbury',
 'North Melissafurt',
 'Kristaburgh',
 'Kristaburgh',
 'Kristaburgh',
 'North Melissafurt',
 'Kristaburgh',
 'Wardfort',
 'Whiteside',
 'North Melissafurt',
 'Aliciafort',
 'Whiteside',
 'Whitakerbury',
 'Aliciafort',
 'North Melissafurt',
 'New Cindychester',
 'New Russellton',
 'North Melissafurt',
 'New Cindychester',
 'New Russellton',
 'New Russellton',
 'Whiteside',
 'New Cindychester',
 'Whitakerbury',
 'Wardfort',
 'Ricardomouth',
 'New Cindychester',
 'New Russellton',
 'Whiteside',
 'Ricardomouth',
 'New Cindychester',
 'New Russellton',
 'West Jamesview',
 'Kristaburgh',
 'West Jamesview',
 'Wardfort',
 'West Jamesview',
 'New Cindychester',
 'North Melissafurt',
 'Aliciafort',
 'North Melissafurt',
 'New Cindychester',
 'Kristaburgh',
 'Whitakerbury',
 'Wardfort',
 'Aliciafort',
 'Whitakerbury',
 'West Jamesview',
 'New Russellton',
 'Whitakerbury',
 'Kristaburgh',
 'West Jamesview',
 'Whitakerbury',
 'Whiteside',
 'New Cindychester',
 'Ricardomouth',
 'Whitakerbury',
 'Wardfort',
 'New Cindychester',
 'Kristaburgh',
 'Wardfort',
 'Kristaburgh',
 'North Melissafurt',
 'Kristaburgh',
 'New Cindychester',
 'Ricardomouth',
 'Kristaburgh',
 'Ricardomouth',
 'New Cindychester',
 'New Russellton',
 'New Cindychester',
 'Whiteside',
 'Ricardomouth',
 'New Cindychester',
 'Ricardomouth',
 'Whitakerbury',
 'North Melissafurt',
 'Whitakerbury',
 'Wardfort',
 'Whitakerbury',
 'Wardfort',
 'West Jamesview',
 'Kristaburgh',
 'Whitakerbury',
 'Whitakerbury',
 'Ricardomouth',
 'Whitakerbury',
 'Wardfort',
 'New Russellton',
 'North Melissafurt',
 'Kristaburgh',
 'Whiteside',
 'Ricardomouth',
 'North Melissafurt',
 'Wardfort',
 'Kristaburgh',
 'West Jamesview',
 'Wardfort',
 'West Jamesview',
 'Wardfort',
 'Aliciafort',
 'Whiteside',
 'West Jamesview',
 'Ricardomouth',
 'Ricardomouth',
 'Aliciafort',
 'Whitakerbury',
 'Kristaburgh',
 'Ricardomouth',
 'Whitakerbury',
 'Whitakerbury',
 'New Cindychester',
 'Whitakerbury',
 'Kristaburgh',
 'Whitakerbury',
 'Aliciafort',
 'Wardfort',
 'Aliciafort',
 'North Melissafurt',
 'West Jamesview',
 'Aliciafort',
 'Aliciafort',
 'West Jamesview',
 'Ricardomouth',
 'Kristaburgh',
 'Wardfort',
 'Whiteside',
 'Wardfort',
 'West Jamesview',
 'Whiteside',
 'New Russellton',
 'West Jamesview',
 'Ricardomouth',
 'Ricardomouth',
 'North Melissafurt',
 'New Cindychester',
 'Aliciafort',
 'North Melissafurt',
 'New Russellton',
 'West Jamesview',
 'New Cindychester',
 'North Melissafurt',
 'West Jamesview',
 'New Russellton',
 'Wardfort',
 'West Jamesview',
 'Wardfort',
 'New Russellton',
 'Ricardomouth',
 'West Jamesview',
 'West Jamesview',
 'New Cindychester',
 'Aliciafort',
 'West Jamesview',
 'Wardfort',
 'Whiteside',
 'West Jamesview',
 'Whiteside',
 'New Russellton',
 'New Cindychester',
 'New Cindychester',
 'Ricardomouth',
 'Kristaburgh',
 'Wardfort',
 'New Russellton',
 'Wardfort',
 'Ricardomouth',
 'New Cindychester',
 'Kristaburgh',
 'Whitakerbury',
 'Ricardomouth',
 'Whiteside',
 'Ricardomouth',
 'Whiteside',
 'North Melissafurt',
 'Whiteside',
 'Ricardomouth',
 'North Melissafurt',
 'West Jamesview',
 'New Russellton',
 'North Melissafurt',
 'Kristaburgh',
 'West Jamesview',
 'Ricardomouth',
 'North Melissafurt',
 'Ricardomouth',
 'New Russellton',
 'New Cindychester',
 'New Cindychester',
 'Whitakerbury',
 'New Cindychester',
 'Ricardomouth',
 'West Jamesview',
 'Ricardomouth',
 'New Russellton',
 'Ricardomouth',
 'Wardfort',
 'Ricardomouth',
 'Aliciafort',
 'Kristaburgh',
 'North Melissafurt',
 'Wardfort',
 'New Cindychester',
 'Aliciafort',
 'New Cindychester',
 'New Cindychester',
 'Whiteside',
 'West Jamesview',
 'Aliciafort',
 'New Russellton',
 'Kristaburgh',
 'Aliciafort',
 'Whiteside',
 'Whitakerbury',
 'North Melissafurt',
 'West Jamesview',
 'New Russellton',
 'Ricardomouth',
 'Aliciafort',
 'Whitakerbury',
 'New Cindychester',
 'West Jamesview',
 'New Russellton',
 'New Cindychester',
 'New Russellton',
 'North Melissafurt',
 'West Jamesview',
 'Ricardomouth',
 'West Jamesview',
 'Whitakerbury',
 'Whitakerbury',
 'Wardfort',
 'Wardfort',
 'Kristaburgh',
 'North Melissafurt',
 'Whitakerbury',
 'New Cindychester',
 'Whitakerbury',
 'New Russellton',
 'New Russellton',
 'Wardfort',
 'New Cindychester',
 'North Melissafurt',
 'Wardfort',
 'Ricardomouth',
 'Kristaburgh',
 'North Melissafurt',
 'Aliciafort',
 'Whiteside',
 'Whitakerbury',
 'Ricardomouth',
 'Ricardomouth',
 'Ricardomouth',
 'North Melissafurt',
 'Ricardomouth',
 'West Jamesview',
 'Wardfort',
 'Wardfort',
 'New Cindychester',
 'North Melissafurt',
 'North Melissafurt',
 'New Cindychester',
 'Whiteside',
 'North Melissafurt',
 'West Jamesview',
 'New Russellton',
 'New Russellton',
 'North Melissafurt',
 'Whitakerbury',
 'Wardfort',
 'Aliciafort',
 'Whitakerbury',
 'Whiteside',
 'Aliciafort',
 'Ricardomouth',
 'Ricardomouth',
 'New Russellton',
 'Whitakerbury',
 'Whiteside',
 'Whiteside',
 'Whiteside',
 'Kristaburgh',
 'Wardfort',
 'Kristaburgh',
 'Whitakerbury',
 'Whiteside',
 'New Cindychester',
 'New Russellton',
 'North Melissafurt',
 'New Russellton',
 'Wardfort',
 'New Cindychester',
 'Kristaburgh',
 'Wardfort',
 'Kristaburgh',
 'North Melissafurt',
 'Whitakerbury',
 'Whitakerbury',
 'Wardfort',
 'Whiteside',
 'Kristaburgh',
 'Ricardomouth',
 'Aliciafort',
 'North Melissafurt',
 'Kristaburgh',
 'Whitakerbury',
 'Whitakerbury',
 'Wardfort',
 'Aliciafort',
 'Ricardomouth',
 'Kristaburgh',
 'Wardfort',
 'New Russellton',
 'North Melissafurt',
 'Wardfort',
 'Kristaburgh',
 'Kristaburgh',
 'Whitakerbury',
 'North Melissafurt',
 'West Jamesview',
 'Whitakerbury',
 'Ricardomouth',
 'Whitakerbury',
 'Wardfort',
 'North Melissafurt',
 'Kristaburgh',
 'Whiteside',
 'New Cindychester',
 'Ricardomouth',
 'New Cindychester',
 'Whitakerbury',
 'Whiteside',
 'Whiteside',
 'New Russellton',
 'Whiteside',
 'Whiteside',
 'Ricardomouth',
 'New Russellton',
 'New Cindychester',
 'Kristaburgh',
 'Aliciafort',
 'New Russellton',
 'Wardfort',
 'New Russellton',
 'Whitakerbury',
 'Aliciafort',
 'Kristaburgh',
 ...]

### 87. Are the number of employees in 'Scott Inc' company greater than that in 'Andrade LLC'? Print True/False

In [40]:
sum(df["Employee_City"]=="Scott Inc") > sum(df["Employee_City"]=="Andrade LLC")

False

### 88. Which is the most common first name in the dataframe?

In [49]:
from collections import Counter

ans = Counter(x[0] for x in df["Name"].str.split())
ans.most_common()[0]

('Michael', 6892)

### 89. Which is the least common last name in the dataframe?

In [50]:
ans.most_common()[-1]

('Terrance', 25)

### 90. What is the average name length?

In [52]:
l = df.shape[0]
n = sum(df["Name"].str.len())
n/l

13.1079

Great job solving this notebook. Go to Pandas Notebook  3: [Link](https://deepnote.com/workspace/avi-chawla-695b-aee6f4ef-2d50-4fb6-9ef2-20ee1022995a/project/Pandas-Notebook-employee-part-2-adc5a3ee-5f61-4725-8e46-ccb07899acfc/%2Fnotebook.ipynb)

<a style='text-decoration:none;line-height:16px;display:flex;color:#5B5B62;padding:10px;justify-content:end;' href='https://deepnote.com?utm_source=created-in-deepnote-cell&projectId=7e3b6755-5d4b-464b-9b75-9c84667ae3bd' target="_blank">
<img alt='Created in deepnote.com' style='display:inline;max-height:16px;margin:0px;margin-right:7.5px;' src='' > </img>
Created in <span style='font-weight:600;margin-left:4px;'>Deepnote</span></a>